test/http_recordings/charge_failures/insufficient_funds.json

[
  {
    "request": {
      "body": "{\"transfer\":null,\"total_fees\":null,\"token\":null,\"settlement_currency\":null,\"refund_pending\":null,\"metadata\":null,\"merchant_entitlement\":null,\"ip_address\":\"127.0.0.1\",\"email\":\"hagrid@hogwarts.wiz\",\"description\":\"Dragon eggs\",\"customer_token\":null,\"currency\":null,\"card_token\":null,\"card\":{\"token\":null,\"number\":\"4000000000000002\",\"name\":\"Rubius Hagrid\",\"expiry_year\":\"20\",\"expiry_month\":\"12\",\"cvc\":\"321\",\"address_state\":null,\"address_postcode\":null,\"address_line2\":null,\"address_line1\":\"The Game Keepers Cottage\",\"address_country\":\"England\",\"address_city\":\"Hogwarts\"},\"captured\":null,\"capture\":null,\"authorisation_expired\":null,\"amount_refunded\":null,\"amount\":50000}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/charges"
    },
    "response": {
      "binary": false,
      "body": "{\"error\":\"insufficient_funds\",\"error_description\":\"There are not enough funds available to process the requested amount\",\"charge_token\":\"ch_vvwrLC2xCPbcFyWxK2vWsQ\"}",
      "headers": {
        "Date": "Wed, 23 May 2018 00:39:00 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "164",
        "Connection": "keep-alive",
        "Server": "nginx",
        "Cache-Control": "no-cache",
        "X-Request-Id": "d66786c4-aee5-414a-bdb7-ed95ff8a9cb7",
        "X-Runtime": "0.170926",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 400,
      "type": "ok"
    }
  }
]