test/http_recordings/charge_failures/processing_error.json

[
  {
    "request": {
      "body": "{\"transfer\":null,\"total_fees\":null,\"token\":null,\"settlement_currency\":null,\"refund_pending\":null,\"metadata\":null,\"merchant_entitlement\":null,\"ip_address\":\"127.0.0.1\",\"email\":\"hagrid@hogwarts.wiz\",\"description\":\"Dragon eggs\",\"customer_token\":null,\"currency\":null,\"card_token\":null,\"card\":{\"token\":null,\"number\":\"4700000000000005\",\"name\":\"Rubius Hagrid\",\"expiry_year\":\"20\",\"expiry_month\":\"12\",\"cvc\":\"321\",\"address_state\":null,\"address_postcode\":null,\"address_line2\":null,\"address_line1\":\"The Game Keepers Cottage\",\"address_country\":\"England\",\"address_city\":\"Hogwarts\"},\"captured\":null,\"capture\":null,\"authorisation_expired\":null,\"amount_refunded\":null,\"amount\":50000}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/charges"
    },
    "response": {
      "binary": false,
      "body": "{\"error\":\"processing_error\",\"error_description\":\"An error occurred while processing the card\",\"charge_token\":\"ch_nQQz3XQbRHXshJYTR_UUoQ\"}",
      "headers": {
        "Date": "Wed, 23 May 2018 00:38:58 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "137",
        "Connection": "keep-alive",
        "Server": "nginx",
        "Cache-Control": "no-cache",
        "X-Request-Id": "17c46230-b14c-4d72-aced-0fdaa2661c9e",
        "X-Runtime": "0.119626",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 400,
      "type": "ok"
    }
  }
]